import React,{Component} from 'react';
import {Card} from 'react-bootstrap';
import './gram.css';

class Sandhi extends Component{
    constructor(props){
        super(props);
    }

    render(){
        return(
            <div className="foo">
                <h1>सन्धिः</h1>
              सन्धि शब्द की व्युत्पत्ति – सम् उपसर्ग पूर्वक डुधाञ् (धा) धातु से “उपसर्गे धोः किः” सूत्र से ‘कि’ प्रत्यय करने पर ‘सन्धि’ शब्द निष्पन्न होता है। सन्धि की परिभाषा – वर्ण सन्धान को सन्धि कहते हैं। अर्थात् दो वर्गों के परस्पर के मेल अथवा सन्धान को सन्धि कहा जाता है।

<br/><br/>पाणिनीय परिभाषा – “परः सन्निकर्षः संहिता” अर्थात् वर्णों की अत्यधिक निकटता को संहिता कहा जाता है। जैसे—’सुधी + उपास्य’ यहाँ ‘ई’ तथा ‘उ’ वर्गों में अत्यन्त निकटता है। इसी प्रकार की वर्गों की निकटता को संस्कृत – व्याकरण में संहिता कहा जाता है। संहिता के विषय में ही सन्धि – कार्य होने पर ‘सुध्युपास्य’ शब्द की सिद्धि होती है।

<br/><br/>सन्धि के भेद – संस्कृत व्याकरण में सन्धि के तीन भेद होते हैं। वे इस प्रकार हैं –
<br/><br/>
<ol>
<li><h3>स्वर सन्धि – अच् संधि</h3>
जब दो स्वरों का सन्धान अथवा मेल होता है, तब वह सन्धान स्वर – सन्धि या अच् सन्धि कही जाती है। यहाँ अच् – सन्धि में स्वर के स्थान पर आदेश होता है। स्वर – सन्धियाँ आठ प्रकार की होती हैं। जैसे –
<br/>
<br/>
<ul>
<li>अ + अ = आ – पुष्प + अवली = पुष्पावली</li>
<li>अ + आ = आ – हिम + आलय = हिमालय</li>
<li>आ + अ = आ – माया + अधीन = मायाधीन</li>
<li>आ + आ = आ – विद्या + आलय = विद्यालय</li>
<li>इ + इ = ई – कवि + इच्छा = कवीच्छा</li>
<li>इ + ई = ई – हरी + ईश = हरीश</li>
<li>इ + इ = ई – मही + इन्द्र = महीन्द्र</li>
<li>इ + ई = ई – नदी + ईश = नदीश</li>
<li>उ + उ = ऊ – सु + उक्ति = सूक्ति</li>
<li>उ + ऊ = ऊ – सिन्धु + ऊर्मि = सिन्धूमि</li>
<li>ऊ + उ = ऊ – वधू + उत्सव = वधूत्सव</li>
<li>ऊ + ऊ = ऊ – भू + ऊर्ध्व = भूल</li>
<li>ऋ+ ऋ = ऋ – मात + ऋण = मातण</li>

</ul>
<br/>
स्वर सन्धि मे सन्धियाँ 7 प्रकार की होती हैं-

यण – सन्धि
अयादि सन्धि
गुण – सन्धि
वृद्धि सन्धि
सवर्णदीर्घ सन्धि
पूर्वरूप सन्धि
पररूप सन्धि
</li>
<li><h1> व्यजन सन्धि – हल् संधि</h1>
व्यंजन के साथ व्यंजन या स्वर का मेल होने से जो विकार होता है, उसे व्यंजन सन्धि कहते हैं। व्यंजन सन्धि के प्रमुख नियम इस प्रकार हैं-

यदि स्पर्श व्यंजनों के प्रथम अक्षर अर्थात् क्, च्, ट्, त्, के आगे कोई स्वर अथवा किसी वर्ग का तीसरा या चौथा वर्ण अथवा य, र, ल, व आए तो क.च.ट. त. पके स्थान पर उसी वर्ग का तीसरा अक्षर अर्थात क के स्थान पर ग, च के स्थान पर ज, ट के स्थान पर ड, त के स्थान पर द और प के स्थान पर ‘ब’ हो जाता है जैसे-

दिक् + अम्बर = दिगम्बर
वाक् + ईश = वागीश
अच् + अन्त = अजन्त
षट् + आनन = षडानन
सत् + आचार = सदाचार
सुप् + सन्त = सुबन्त
उत् + घाटन = उद्घाटन
तत् + रूप = तद्रूप
व्यंजन संधि मे सन्धियाँ 6 प्रकार की होती हैं-

श्चत्व सन्धि
ष्टुत्व सन्धि
जश्त्व सन्धि
चर्व सन्धिः
अनुस्वार
परसवर्ण सन्धिः
2. विसर्ग सन्धि
जब विसर्ग के स्थान पर कोई भी परिवर्तन होता है, तब उसे विसर्ग – सन्धि कहा जाता है। विसर्गों का प्रयोग संस्कृत को छोड़कर संसार की किसी भी भाषा में नहीं होता है। हिन्दी में भी विसर्गों का प्रयोग नहीं के बराबर होता है। कुछ इने-गिने विसर्गयुक्त शब्द हिन्दी में प्रयुक्त होते हैं;

जैसे-

अत:, पुनः, प्रायः, शनैः शनैः आदि।
हिन्दी में मनः, तेजः, आयुः, हरिः के स्थान पर मन, तेज, आयु, हरि शब्द चलते हैं, इसलिए यहाँ विसर्ग सन्धि का प्रश्न ही नहीं उठता। फिर भी हिन्दी पर संस्कृत का सबसे अधिक प्रभाव है। संस्कृत के अधिकांश विधि निषेध हिन्दी में प्रचलित हैं। विसर्ग सन्धि के ज्ञान के अभाव में हम वर्तनी की अशुद्धियों से मुक्त नहीं हो सकते। अत: इसका ज्ञान होना आवश्यक है।

निः + शंक = निश्शंक
दुः + शासन = दुश्शासन
निः + सन्देह = निस्सन्देह
नि: + संग = निस्संग
निः + शब्द = निश्शब्द
निः + स्वार्थ = निस्स्वार्थ
विसर्ग – संधि मे सन्धियाँ 4 प्रकार की होती हैं-

सत्व सन्धि
उत्व सन्धि
रुत्व सन्धि
लोप सन्धि
</li>
</ol>
            </div>
        )
    }
}

export default Sandhi;